[Equipment_Familiar_Dragon HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Basic Familiar"
EquipmentDescription="Shoots fireballs at your opponents."
RandomBaseNames[0]=(StringValue="Dragon")
RandomBaseNames[1]=(StringValue="Apophis")
RandomBaseNames[2]=(StringValue="Devon")
RandomBaseNames[3]=(StringValue="Draco")
RandomBaseNames[4]=(StringValue="Fafnir")
RandomBaseNames[5]=(StringValue="Ketu")
RandomBaseNames[6]=(StringValue="Lung")
RandomBaseNames[7]=(StringValue="Rahu")
RandomBaseNames[8]=(StringValue="Yong")
RandomBaseNames[9]=(StringValue="Ryujin")

[Equipment_Familiar_Fairy HeroEquipment_Familiar_PlayerHealer]
EquipmentName="Basic Familiar"
EquipmentStatNames[0]="Hero Heal Amount"
EquipmentStatNames[3]="Heal Speed"
EquipmentDescription="Heals yourself and your allies when you need it."
RandomBaseNames[0]=(StringValue="Fairy")
RandomBaseNames[1]=(StringValue="Alvara")
RandomBaseNames[2]=(StringValue="Blossom")
RandomBaseNames[3]=(StringValue="Dulcina")
RandomBaseNames[4]=(StringValue="Elvie")
RandomBaseNames[5]=(StringValue="Faye")
RandomBaseNames[6]=(StringValue="Lilly")
RandomBaseNames[7]=(StringValue="Nixie")
RandomBaseNames[8]=(StringValue="Zanna")
RandomBaseNames[9]=(StringValue="Ophelia")

[Equipment_Familiar_Genie HeroEquipment_Familiar_MoneyGiver]
EquipmentName="Basic Familiar"
EquipmentStatNames[0]="Mana Collection Bonus"
EquipmentDescription="Grants Mana to you when you damage your opponents."
RandomBaseNames[0]=(StringValue="Genie")
RandomBaseNames[1]=(StringValue="Dusa")
RandomBaseNames[2]=(StringValue="Hanio")
RandomBaseNames[3]=(StringValue="Nurzhan")
RandomBaseNames[4]=(StringValue="Spiro")
RandomBaseNames[5]=(StringValue="Tien")
RandomBaseNames[6]=(StringValue="Menos")
RandomBaseNames[7]=(StringValue="Hugo")
RandomBaseNames[8]=(StringValue="Huzzah")
RandomBaseNames[9]=(StringValue="Shazzam")

[Equipment_Familiar_Griffon HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Basic Familiar"
EquipmentDescription="Shoots lightning bolts at your opponents."
RandomBaseNames[0]=(StringValue="Griffon")
RandomBaseNames[1]=(StringValue="Skye")
RandomBaseNames[2]=(StringValue="Vergil")
RandomBaseNames[3]=(StringValue="Obayo")
RandomBaseNames[4]=(StringValue="Casper")
RandomBaseNames[5]=(StringValue="Topaz")
RandomBaseNames[6]=(StringValue="Calypso")
RandomBaseNames[7]=(StringValue="Parley")
RandomBaseNames[8]=(StringValue="Emeril")
RandomBaseNames[9]=(StringValue="Beaker")

[Equipment_Familiar_Hawk HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Basic Familiar"
EquipmentDescription="Hurls arrows at your opponents."
RandomBaseNames[0]=(StringValue="Hawk")
RandomBaseNames[1]=(StringValue="Ayah")
RandomBaseNames[2]=(StringValue="Shea")
RandomBaseNames[3]=(StringValue="Heru")
RandomBaseNames[4]=(StringValue="Horus")
RandomBaseNames[5]=(StringValue="Shaylyn")
RandomBaseNames[6]=(StringValue="Christo")
RandomBaseNames[7]=(StringValue="Kadi")
RandomBaseNames[8]=(StringValue="Snavel")
RandomBaseNames[9]=(StringValue="Rostro")

[Equipment_Familiar_Imp HeroEquipment_Familiar_TowerHealer]
EquipmentName="Basic Familiar"
EquipmentStatNames[0]="Defense Heal Amount"
EquipmentStatNames[3]="Heal Speed"
EquipmentDescription="Heals needy Defenses, but drains your Mana."
RandomBaseNames[0]=(StringValue="Imp")
RandomBaseNames[1]=(StringValue="Bael")
RandomBaseNames[2]=(StringValue="Abaddon")
RandomBaseNames[3]=(StringValue="Belphegor")
RandomBaseNames[4]=(StringValue="Gaap")
RandomBaseNames[5]=(StringValue="Malphas")
RandomBaseNames[6]=(StringValue="Xaphan")
RandomBaseNames[7]=(StringValue="Valafar")
RandomBaseNames[8]=(StringValue="Mephisto")
RandomBaseNames[9]=(StringValue="Faalva")

[Equipment_Familiar_Serpent HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Basic Familiar"
EquipmentDescription="Shoots poison blasts at your opponents."
RandomBaseNames[0]=(StringValue="Serpent")
RandomBaseNames[1]=(StringValue="Allister")
RandomBaseNames[2]=(StringValue="Basila")
RandomBaseNames[3]=(StringValue="Bijou")
RandomBaseNames[4]=(StringValue="Isis")
RandomBaseNames[5]=(StringValue="Jafar")
RandomBaseNames[6]=(StringValue="Madusa")
RandomBaseNames[7]=(StringValue="Serpico")
RandomBaseNames[8]=(StringValue="Xilis")
RandomBaseNames[9]=(StringValue="Ssuma")

[Equipment_Familiar_Giraffe HeroEquipment_Familiar_Melee]
EquipmentName="Giraffe on Treadmill"
EquipmentDescription="Is epic win."
RandomBaseNames[0]=(StringValue="Giraffe on Treadmill")

[Equipment_Familiar_Tiger2 HeroEquipment_Familiar_Melee]
EquipmentName="Basic Familiar"
EquipmentStatNames[0]="Melee Damage"
EquipmentStatNames[3]="Attack Speed"
EquipmentDescription="Attacks your opponents with ferocious bites."
RandomBaseNames[0]=(StringValue="Tiger")
RandomBaseNames[1]=(StringValue="Luin")
RandomBaseNames[2]=(StringValue="Byakko")
RandomBaseNames[3]=(StringValue="Esh")
RandomBaseNames[4]=(StringValue="Rayure")
RandomBaseNames[5]=(StringValue="Liger")
RandomBaseNames[6]=(StringValue="Quartz")
RandomBaseNames[7]=(StringValue="Symba")
RandomBaseNames[8]=(StringValue="Nahla")
RandomBaseNames[9]=(StringValue="Tsuda")

[Equipment_Familiar_Chicken HeroEquipment_Familiar_Melee]
EquipmentName="Chicken"
EquipmentDescription="Attacks your opponents with eggs and pecking."
RandomBaseNames[0]=(StringValue="Chicken")
RandomBaseNames[1]=(StringValue="Fowl")
RandomBaseNames[2]=(StringValue="Clucks")
RandomBaseNames[3]=(StringValue="Squawk")
RandomBaseNames[4]=(StringValue="Chirpy")
RandomBaseNames[5]=(StringValue="Feather Flocklear")
RandomBaseNames[6]=(StringValue="Eggy")
RandomBaseNames[7]=(StringValue="Coup")
RandomBaseNames[8]=(StringValue="Bacaw")
RandomBaseNames[9]=(StringValue="Egg Layer")

[Equipment_Familiar_Hamster HeroEquipment_Familiar_WithProjectileAI]
EquipmentDescription="Attacks your opponents with bursts of hammy love."
RandomBaseNames[0]=(StringValue="Hamster")
RandomBaseNames[1]=(StringValue="Wings")
RandomBaseNames[2]=(StringValue="Scruffy")
RandomBaseNames[3]=(StringValue="Fluffy")
RandomBaseNames[4]=(StringValue="Hermes")
RandomBaseNames[5]=(StringValue="Hamustro")
RandomBaseNames[6]=(StringValue="Moustache")
RandomBaseNames[7]=(StringValue="Furry")
RandomBaseNames[8]=(StringValue="Bushy")
RandomBaseNames[9]=(StringValue="Flushed")

[Equipment_Familiar_Robot HeroEquipment_Familiar_Melee]
EquipmentDescription="Attacks your opponents with barrel rolls. Do one!"
RandomBaseNames[0]=(StringValue="Robot")
RandomBaseNames[1]=(StringValue="Foundry")
RandomBaseNames[2]=(StringValue="Forge")
RandomBaseNames[3]=(StringValue="Smelter")
RandomBaseNames[4]=(StringValue="Frizzle")
RandomBaseNames[5]=(StringValue="Ingot")
RandomBaseNames[6]=(StringValue="Grill")
RandomBaseNames[7]=(StringValue="Kindle")
RandomBaseNames[8]=(StringValue="Toasty")
RandomBaseNames[9]=(StringValue="Scorchy")

[Equipment_Familiar_Destructoid HeroEquipment_Familiar_WithProjectileAI]
EquipmentDescription="Attacks your opponents with laserbeams shot from its eyes."
RandomBaseNames[0]=(StringValue="Destructoid")
RandomBaseNames[1]=(StringValue="Destructoid")
RandomBaseNames[2]=(StringValue="Destructoid")
RandomBaseNames[3]=(StringValue="Destructoid")
RandomBaseNames[4]=(StringValue="Hurtz")
RandomBaseNames[5]=(StringValue="Bzzt")
RandomBaseNames[6]=(StringValue="Gort")
RandomBaseNames[7]=(StringValue="Marvin")
RandomBaseNames[8]=(StringValue="Bishop")
RandomBaseNames[9]=(StringValue="Smoking Spaceman")

[Equipment_Familiar_Monkey HeroEquipment_Familiar_WithProjectileAI]
EquipmentDescription="Shoots HEROIC pistol bananas at close range, PLUS a HEROIC sniper banana at far range!"
RandomBaseNames[0]=(StringValue="Monkey")
